In [1]:
import pandas as pd
import numpy as np
import import_ipynb
from utils import show
import json

importing Jupyter notebook from utils.ipynb

In [3]:
import sqlite3
query = """
    CREATE TABLE test
    (a VARCHAR(20), b VARCHAR(20),
     c REAL, d INTEGER
     );
    """

In [4]:
con = sqlite3.connect('mydata.sqlite')

In [5]:
con.execute(query)

In [6]:
con.commit()

In [7]:
data = [('Atlanta','Georgia',1.25,6),
        ('Tallahassee','Florida',2.6,3),
        ('Sacramento','California',1.7,5)]

In [8]:
stmt = "INSERT INTO test VALUES(?,?,?,?)"

In [9]:
con.executemany(stmt,data)

In [10]:
con.commit()

In [11]:
cursor = con.execute('select * from test')

In [12]:
rows = cursor.fetchall()

In [14]:
rows

[('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5)]

In [15]:
cursor.description

(('a', None, None, None, None, None, None),
 ('b', None, None, None, None, None, None),
 ('c', None, None, None, None, None, None),
 ('d', None, None, None, None, None, None))

In [16]:
frame = pd.DataFrame(rows,columns=[x[0] for x in cursor.description])
show(frame)

<class 'pandas.core.frame.DataFrame'>
--------------------
             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5

In [18]:
frame

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5

In [19]:
import sqlalchemy as sqla

In [20]:
db = sqla.create_engine('sqlite:///mydata.sqlite')

In [22]:
pd.read_sql('select * from test', db)

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5